# Creating Tables
Table.read_table(Filename)= reads the data from spreadsheet
Table()= empty table

Arrays to Tables
Table.with_column(label, data)==Creates table with a single column; data is an array
Table.with_column(label1, data1,......)==Creates table; with an array of data for each column

Table Methods:- 
    Find Sizing : num_rows and num_columns method

We have a table called "students," and it has some data about some of the students Name, ID, and Score.
I would like you to construct for me a new table that consists of only the column labeled "Name" and the data in that column.
a. what code you'd write to get that table.
students.select('Name')
b. largest score
student.column('score').max() or max(student.column('score'))

Here are the table methods we learned.  These will be important later on in the course!

Table.read_table(filename) :- create a table with data from a file

Table() :- create an empty table

Table().with_columns(name, values, ...) :- creates a table with an array of values for each column name

tbl.with_columns(name, values, ...) :- appends a column name with an array of values to an existing table

tbl.num_rows :- returns the number of rows in a table

tbl.num_columns  :- returns the number of columns in a table

tbl.labels :- returns a list of column labels of a table

tbl.relabeled(old_label, new_label) :- returns a new table with a changed label column

tbl.drop(col1, col2, …) :- returns a table without the dropped columns

# Strings

In [ ]:
#Convert String to number
int('12')
float('1.2')
#Convert number to String 
str(5)

In [4]:
import numpy as np
import pandas as pd

import matplotlib.pyplot as plt
%matplotlib inline

In [ ]:
'I Love Cricket'

In [ ]:
'2.3'

In [ ]:
'2' + 4

In [ ]:
'2.3'*4

In [ ]:
#Concate the string
'2.3' + '4.6'

In [ ]:
int('1.2')

In [ ]:
int('22')+float('3.5')

In [ ]:
x=12

In [ ]:
int(str(x)+'0')

In [ ]:
x=3
y='4'
z='5.6'

In [ ]:
x+y
#x+int(y+z)
#str(x)+int(y)
#str(x,y)+z

In [ ]:
#Pratice: Write answer if error write error
a = 2
b = '3'
c = '4.5'
d = 10

In [ ]:
int(b)

In [ ]:
str(a)

In [ ]:
int(c)

In [ ]:
a*b

In [ ]:
int(str(d)+b)

In [ ]:
int(str(a)*c)

# DataFram Explore

In [8]:
df = pd.read_csv('C:\\Nitin_StudyWork\\DSP\\Other\\students-performance-in-exams\\StudentsPerformance.csv')

In [17]:
df

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

In [11]:
df.columns

Index(['gender', 'race/ethnicity', 'parental level of education', 'lunch',
       'test preparation course', 'math score', 'reading score',
       'writing score'],
      dtype='object')

In [16]:
df['gender']

0      female
1      female
2      female
3        male
4        male
        ...
995    female
996      male
997    female
998    female
999    female
Name: gender, Length: 1000, dtype: object

In [15]:
pd.set_option('max_rows', 10)

In [21]:
df.describe(include='all').T

,count,unique,top,freq,mean,std,min,25%,50%,75%,max
gender,1000,2,female,518,NaN,NaN,NaN,NaN,NaN,NaN,NaN
race/ethnicity,1000,5,group C,319,NaN,NaN,NaN,NaN,NaN,NaN,NaN
parental level of education,1000,6,some college,226,NaN,NaN,NaN,NaN,NaN,NaN,NaN
lunch,1000,2,standard,645,NaN,NaN,NaN,NaN,NaN,NaN,NaN
test preparation course,1000,2,none,642,NaN,NaN,NaN,NaN,NaN,NaN,NaN
math score,1000,NaN,NaN,NaN,66.089,15.1631,0,57,66,77,100
reading score,1000,NaN,NaN,NaN,69.169,14.6002,17,59,70,79,100
writing score,1000,NaN,NaN,NaN,68.054,15.1957,10,57.75,69,79,100

In [23]:
df.dtypes

gender                         object
race/ethnicity                 object
parental level of education    object
lunch                          object
test preparation course        object
math score                      int64
reading score                   int64
writing score                   int64
dtype: object

In [24]:
df.isnull().sum()

gender                         0
race/ethnicity                 0
parental level of education    0
lunch                          0
test preparation course        0
math score                     0
reading score                  0
writing score                  0
dtype: int64

In [25]:
df['test preparation course'].value_counts()

none         642
completed    358
Name: test preparation course, dtype: int64

In [26]:
df['lunch'].value_counts()

standard        645
free/reduced    355
Name: lunch, dtype: int64

In [27]:
df['parental level of education'].value_counts()

some college          226
associate's degree    222
high school           196
some high school      179
bachelor's degree     118
master's degree        59
Name: parental level of education, dtype: int64

In [29]:
df['race/ethnicity'].value_counts()

group C    319
group D    262
group B    190
group E    140
group A     89
Name: race/ethnicity, dtype: int64

In [4]:
import numpy as np
x = np.array([23, 21, 0, 24])
y = np.array([7, 22, 0, 22])
z = np.row_stack([x, y])
print(z.shape)

(2, 4)